In [2]:
import pandas as pd
import numpy as np
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,np.nan,99,87,np.nan,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female'],
                'Email':['priyang@gmail.com','aadhya@gmail.com',
                        'krisha@gmail.com','vedant@yahoo.com','parshv@hotmail.com',
                         'mittal@yahoo.com','archana@yahoo.com']
               }
df=pd.DataFrame(dict1)
df

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

### **1. Display Top 3 Rows**

In [3]:
df.head(3)

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
1   Aadhya    NaN  Female   aadhya@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com

### **2. Display Last 3 Rows**

In [5]:
df.tail(3)

      Name  Marks  Gender               Email
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

### **3. Display All Rows Except last 2 Rows**

In [6]:
# Method 1
df.head(len(df)-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

In [7]:
# Method 2
df.head(-2)

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com

### **4. Display All Rows Except First 3 Rows**

In [9]:
# Method 1
df.tail(len(df)-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [10]:
# Method 2
df.tail(-3)

      Name  Marks  Gender               Email
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

### **5. Find Shape of Our Dataset**

In [13]:
df.shape

(7, 4)

In [14]:
print("Number of Rows: ", df.shape[0])
print("Number of Columns: ", df.shape[1])

Number of Rows:  7
Number of Columns:  4

### **6. To Check How Many Rows are there in Email Column**

In [15]:
df["Email"].shape

(7,)

### **7. Get Information About Our Dataset**

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   5 non-null      float64
 2   Gender  7 non-null      object
 3   Email   7 non-null      object
dtypes: float64(1), object(3)
memory usage: 356.0+ bytes

### **8. Check Null Values in Our Dataset**

In [17]:
print("Is there any null values in dataset: ",df.isnull().values.any())

Is there any null values in dataset:  True

In [18]:
df.isnull().sum()

Name      0
Marks     2
Gender    0
Email     0
dtype: int64

### **9. Get Overall Statistics About the Dataset**

In [21]:
df.describe(include='all')

           Name      Marks  Gender              Email
count         7   5.000000       7                  7
unique        7        NaN       2                  7
top     Priyang        NaN  Female  priyang@gmail.com
freq          1        NaN       4                  1
mean        NaN  93.200000     NaN                NaN
std         NaN   7.628892     NaN                NaN
min         NaN  83.000000     NaN                NaN
25%         NaN  87.000000     NaN                NaN
50%         NaN  98.000000     NaN                NaN
75%         NaN  99.000000     NaN                NaN
max         NaN  99.000000     NaN                NaN

### **10. Find Unique Values from the Gender Column**

In [23]:
df["Gender"].unique()
# Unique Method Can be applied only to Series not DataFrames.

array(['Male', 'Female'], dtype=object)

### **11. Find the Number of Unique Values from the Gender Column**

In [26]:
df["Gender"].nunique()
# nunique method can be applied to both Series and Dataframes.

2

### **12. Display Count of Unique Values in Gender Column**

In [28]:
df["Gender"].value_counts()
# This Method Can be applied to only Series

Gender
Female    4
Male      3
Name: count, dtype: int64

### **13. Handling Missing Values**

In [29]:
df.dropna() # Drops Entire Rows With Missing Values

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [30]:
df.dropna(how = 'any') # Drops Rows if it has any missing values

      Name  Marks  Gender              Email
0  Priyang   98.0    Male  priyang@gmail.com
2   Krisha   99.0  Female   krisha@gmail.com
3   Vedant   87.0    Male   vedant@yahoo.com
5   Mittal   83.0  Female   mittal@yahoo.com
6  Archana   99.0  Female  archana@yahoo.com

In [31]:
df.dropna(how = 'all') # Drops Rows if it has all missing values

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya    NaN  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv    NaN    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

In [34]:
df["Marks"] = df["Marks"].fillna(df["Marks"].mean())

# Like this We can use:
# Mean
# Median
# Mode
# Forward Fill
# Backward Fill
# Interpolation
# Replacing with Some Constants like 0 or Unknown

In [35]:
df

      Name  Marks  Gender               Email
0  Priyang   98.0    Male   priyang@gmail.com
1   Aadhya   93.2  Female    aadhya@gmail.com
2   Krisha   99.0  Female    krisha@gmail.com
3   Vedant   87.0    Male    vedant@yahoo.com
4   Parshv   93.2    Male  parshv@hotmail.com
5   Mittal   83.0  Female    mittal@yahoo.com
6  Archana   99.0  Female   archana@yahoo.com

### **14. Display the Counts of the Records which has Marks between 80 and 90**

In [38]:
# Method 1:
sum(df["Marks"].between(80,90))

2

In [40]:
# Method 2:
sum((df["Marks"] >= 80) & (df["Marks"] <= 90))

2

### **15. Name of the Students with Lowest Marks**

In [46]:
df[df["Marks"] == (df["Marks"].min())]["Name"]

5    Mittal
Name: Name, dtype: object

### **16. Top Name of the 5 students By their Marks**

In [53]:
# Method 1:
df.sort_values(by = "Marks", ascending = False).head()[["Name", "Marks"]]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

In [54]:
# Method 2:
df.nlargest(5, 'Marks')[["Name", "Marks"]]

      Name  Marks
2   Krisha   99.0
6  Archana   99.0
0  Priyang   98.0
1   Aadhya   93.2
4   Parshv   93.2

### **17. Find Average Marks**

In [57]:
print(f"Average Marks is: {df['Marks'].mean()}")

Average Marks is: 93.2

### **18. Apply Method: Create a New Column with the 50% of actual values**

In [59]:
# Method 1:
df["Half_Marks"] = df["Marks"].apply(lambda x: x/2)
df

      Name  Marks  Gender               Email  Half_Marks
0  Priyang   98.0    Male   priyang@gmail.com        49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5

In [61]:
# Method 2:
def function1(x):
    return x/2
df["Half_Marks1"] = df["Marks"].apply(function1)
df

      Name  Marks  Gender               Email  Half_Marks  Half_Marks1
0  Priyang   98.0    Male   priyang@gmail.com        49.0         49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6         46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5         49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5         43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6         46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5         41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5         49.5

### **19. Map Function: Convert Values in Gender Column Male - 1, Female - 0**

In [66]:
df["Mapped_Gender"] = df["Gender"].map({"Male":1, "Female":0})
df

,Name,Marks,Gender,Email,Half_Marks,Half_Marks1,Mapped_Gender
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,1
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,0
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,0
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,1
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,1
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,0
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,0

### **20. Drop Mapped Gender Column**

In [67]:
df.drop("Mapped_Gender", axis = 1, inplace = True)
df

      Name  Marks  Gender               Email  Half_Marks  Half_Marks1
0  Priyang   98.0    Male   priyang@gmail.com        49.0         49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6         46.6
2   Krisha   99.0  Female    krisha@gmail.com        49.5         49.5
3   Vedant   87.0    Male    vedant@yahoo.com        43.5         43.5
4   Parshv   93.2    Male  parshv@hotmail.com        46.6         46.6
5   Mittal   83.0  Female    mittal@yahoo.com        41.5         41.5
6  Archana   99.0  Female   archana@yahoo.com        49.5         49.5

### **21. Sort the Dataframe as per Marks Column**

In [68]:
df.sort_values(by = "Marks", ascending = False)

      Name  Marks  Gender               Email  Half_Marks  Half_Marks1
2   Krisha   99.0  Female    krisha@gmail.com        49.5         49.5
6  Archana   99.0  Female   archana@yahoo.com        49.5         49.5
0  Priyang   98.0    Male   priyang@gmail.com        49.0         49.0
1   Aadhya   93.2  Female    aadhya@gmail.com        46.6         46.6
4   Parshv   93.2    Male  parshv@hotmail.com        46.6         46.6
3   Vedant   87.0    Male    vedant@yahoo.com        43.5         43.5
5   Mittal   83.0  Female    mittal@yahoo.com        41.5         41.5

### **22. Display Name and Marks of Female Student Only**

In [69]:
# Method 1:
df[df["Gender"] == "Female"][["Name","Marks"]]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

In [76]:
# Method 2:
df[df["Gender"].isin(["Female"])][["Name","Marks"]]

      Name  Marks
1   Aadhya   93.2
2   Krisha   99.0
5   Mittal   83.0
6  Archana   99.0

### **23. Rename the Columns: Marks - Final_Marks**

In [79]:
df.rename(columns = {"Marks":"Final_Marks"}, inplace = True)
df

      Name  Final_Marks  Gender               Email  Half_Marks  Half_Marks1
0  Priyang         98.0    Male   priyang@gmail.com        49.0         49.0
1   Aadhya         93.2  Female    aadhya@gmail.com        46.6         46.6
2   Krisha         99.0  Female    krisha@gmail.com        49.5         49.5
3   Vedant         87.0    Male    vedant@yahoo.com        43.5         43.5
4   Parshv         93.2    Male  parshv@hotmail.com        46.6         46.6
5   Mittal         83.0  Female    mittal@yahoo.com        41.5         41.5
6  Archana         99.0  Female   archana@yahoo.com        49.5         49.5

### **24. Concatenate 2 Dataframes**

In [81]:
df1 = pd.DataFrame({"Name":"Anil","Marks":90, "Gender":"Male","Email":"anil@gmail.com"}, index = [0])
df1

   Name  Marks Gender           Email
0  Anil     90   Male  anil@gmail.com

In [82]:
df

      Name  Final_Marks  Gender               Email  Half_Marks  Half_Marks1
0  Priyang         98.0    Male   priyang@gmail.com        49.0         49.0
1   Aadhya         93.2  Female    aadhya@gmail.com        46.6         46.6
2   Krisha         99.0  Female    krisha@gmail.com        49.5         49.5
3   Vedant         87.0    Male    vedant@yahoo.com        43.5         43.5
4   Parshv         93.2    Male  parshv@hotmail.com        46.6         46.6
5   Mittal         83.0  Female    mittal@yahoo.com        41.5         41.5
6  Archana         99.0  Female   archana@yahoo.com        49.5         49.5

In [85]:
df2 = pd.concat((df,df1), ignore_index = True)
df2

,Name,Final_Marks,Gender,Email,Half_Marks,Half_Marks1,Marks
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,NaN
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,NaN
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,NaN
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,NaN
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,NaN
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,NaN
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,NaN
7,Anil,NaN,Male,anil@gmail.com,NaN,NaN,90.0

### **25. loc and iloc**

````
1. df.loc[Rows, Columns]
    - Accessing Elements through Label
    - In Slicing Using loc both start and end are included.
    - Example: df.loc[0:4, ["Name"]]
    - From 0 to 4 th Row All are Included

2. df.iloc[Rows, Columns]
    - Accessing Elements through position or index
    - In Slicing Using iloc start and end-1 are included.
    - Example: df.iloc[0:4, ["Name"]]
    - From 0 to 3 th Rows are Included

### **26. Create New Feature Using Existing Ones**

In [97]:
df["Name_Marks"] = df["Name"] + " " + "-" + " " + df["Final_Marks"].apply(str)
# Here If we apply like this: str(df["Final_Marks"]) it will give error
# We have to convert Elements in that column ans str so give df["Final+_Marks"].apply(str)

In [98]:
df

,Name,Final_Marks,Gender,Email,Half_Marks,Half_Marks1,Name_Marks
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,Priyang - 98.0
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,Aadhya - 93.2
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,Krisha - 99.0
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,Vedant - 87.0
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,Parshv - 93.2
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,Mittal - 83.0
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,Archana - 99.0

### **27. Find the Highest Average Value Per Gender**

In [107]:
df2 = df.groupby("Gender")["Final_Marks"].agg('mean').to_frame()

In [108]:
df2.head(1)

        Final_Marks
Gender
Female        93.55

### **28. What are the Top 5 Most Popular Email Providers**

In [115]:
# Method 1:
list1 = []

for email in df["Email"]:
    list1.append(email.split("@")[1])
print(list1)

['gmail.com', 'gmail.com', 'gmail.com', 'yahoo.com', 'hotmail.com', 'yahoo.com', 'yahoo.com']

In [116]:
df["Temp"] = list1

In [117]:
df

,Name,Final_Marks,Gender,Email,Half_Marks,Half_Marks1,Name_Marks,Temp
0,Priyang,98.0,Male,priyang@gmail.com,49.0,49.0,Priyang - 98.0,gmail.com
1,Aadhya,93.2,Female,aadhya@gmail.com,46.6,46.6,Aadhya - 93.2,gmail.com
2,Krisha,99.0,Female,krisha@gmail.com,49.5,49.5,Krisha - 99.0,gmail.com
3,Vedant,87.0,Male,vedant@yahoo.com,43.5,43.5,Vedant - 87.0,yahoo.com
4,Parshv,93.2,Male,parshv@hotmail.com,46.6,46.6,Parshv - 93.2,hotmail.com
5,Mittal,83.0,Female,mittal@yahoo.com,41.5,41.5,Mittal - 83.0,yahoo.com
6,Archana,99.0,Female,archana@yahoo.com,49.5,49.5,Archana - 99.0,yahoo.com

In [119]:
df["Temp"].value_counts()

Temp
gmail.com      3
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64

In [122]:
# Method 2:
df["Email"].apply(lambda x:x.split('@')[1]).value_counts().head()

Email
gmail.com      3
yahoo.com      3
hotmail.com    1
Name: count, dtype: int64

-----------------------